/*
Exercise 2
Write a program in which you define four variables of types char, int, float and double

Упражнение 2
Напишите программу, в которой определите четыре переменных типов char, int, float и double
*/

#include <stdio.h>

int main(void)
{
    
    printf("Hello world!\nHello C!\n");

    return 0;
}

//gcc exercise1.c -o exercise1 && ./exercise1
