/*
Exercise 1:
Write a program that outputs two lines to the console: 
"Hello World" and "Hello C"

Упражнение 1:
Напишите программу, которая выводит на консоль две строки: 
"Hello World" и "Hello C"
*/

#include <stdio.h>

int main(void)
{
    
    printf("Hello world!\nHello C!\n");

    return 0;
}

//gcc exercise1.c -o exercise1 && ./exercise1
